#### [`repos-partners`] Terraform Plan 📖`success`

<a href="https://app.terraform.io/app/cdktf-team/prebuilt-providers-partners/runs/run-1SUMMt7rsuPN9o7M" target="_blank">Remote Plan Link ↗️</a>

<details><summary>Show Plan</summary>

```tf
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers-partners/runs/run-1SUMMt7rsuPN9o7M

Waiting for the plan to start...

Terraform v1.6.2
on linux_amd64
Initializing plugins and modules...
data.github_team.cdktf-team-cdktf: Reading...
data.github_team.cdktf-team-cdktf: Read complete after 3s [id=6602018]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_actions_secret.cdktf-provider-launchdarkly_repo_secret-alert-prs-slack-webhook-url_5DE6A783 will be created
  + resource "github_actions_secret" "cdktf-provider-launchdarkly_repo_secret-alert-prs-slack-webhook-url_5DE6A783" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-launchdarkly"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-launchdarkly_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_6A5F0817 will be created
  + resource "github_actions_secret" "cdktf-provider-launchdarkly_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_6A5F0817" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-launchdarkly"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-launchdarkly_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_042F7D01 will be created
  + resource "github_actions_secret" "cdktf-provider-launchdarkly_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_042F7D01" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-launchdarkly"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-launchdarkly_repo_secret-gh-token_85560652 will be created
  + resource "github_actions_secret" "cdktf-provider-launchdarkly_repo_secret-gh-token_85560652" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-launchdarkly"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-launchdarkly_repo_secret-maven-gpg-private-key-passphrase_F7104486 will be created
  + resource "github_actions_secret" "cdktf-provider-launchdarkly_repo_secret-maven-gpg-private-key-passphrase_F7104486" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-launchdarkly"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-launchdarkly_repo_secret-maven-gpg-private-key_C1E80DCE will be created
  + resource "github_actions_secret" "cdktf-provider-launchdarkly_repo_secret-maven-gpg-private-key_C1E80DCE" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-launchdarkly"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-launchdarkly_repo_secret-maven-password_503A29DE will be created
  + resource "github_actions_secret" "cdktf-provider-launchdarkly_repo_secret-maven-password_503A29DE" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-launchdarkly"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-launchdarkly_repo_secret-maven-staging-profile-id_9B871CBC will be created
  + resource "github_actions_secret" "cdktf-provider-launchdarkly_repo_secret-maven-staging-profile-id_9B871CBC" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-launchdarkly"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-launchdarkly_repo_secret-maven-username_244E333C will be created
  + resource "github_actions_secret" "cdktf-provider-launchdarkly_repo_secret-maven-username_244E333C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-launchdarkly"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-launchdarkly_repo_secret-npm-token_2815257C will be created
  + resource "github_actions_secret" "cdktf-provider-launchdarkly_repo_secret-npm-token_2815257C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-launchdarkly"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-launchdarkly_repo_secret-nuget-api-key_2B54AA56 will be created
  + resource "github_actions_secret" "cdktf-provider-launchdarkly_repo_secret-nuget-api-key_2B54AA56" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-launchdarkly"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-launchdarkly_repo_secret-twine-password_5E892A79 will be created
  + resource "github_actions_secret" "cdktf-provider-launchdarkly_repo_secret-twine-password_5E892A79" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-launchdarkly"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-launchdarkly_repo_secret-twine-username_2ED8E9BA will be created
  + resource "github_actions_secret" "cdktf-provider-launchdarkly_repo_secret-twine-username_2ED8E9BA" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-launchdarkly"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-alert-prs-slack-webhook-url_A0CA0B2B will be created
  + resource "github_actions_secret" "cdktf-provider-mongodbatlas_repo_secret-alert-prs-slack-webhook-url_A0CA0B2B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_1B9B597E will be created
  + resource "github_actions_secret" "cdktf-provider-mongodbatlas_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_1B9B597E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_8FE34BA4 will be created
  + resource "github_actions_secret" "cdktf-provider-mongodbatlas_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_8FE34BA4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-gh-token_6F32D8A9 will be created
  + resource "github_actions_secret" "cdktf-provider-mongodbatlas_repo_secret-gh-token_6F32D8A9" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-maven-gpg-private-key-passphrase_64B68B77 will be created
  + resource "github_actions_secret" "cdktf-provider-mongodbatlas_repo_secret-maven-gpg-private-key-passphrase_64B68B77" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-maven-gpg-private-key_CE85BAE4 will be created
  + resource "github_actions_secret" "cdktf-provider-mongodbatlas_repo_secret-maven-gpg-private-key_CE85BAE4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-maven-password_95B7424C will be created
  + resource "github_actions_secret" "cdktf-provider-mongodbatlas_repo_secret-maven-password_95B7424C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-maven-staging-profile-id_7A0DF91E will be created
  + resource "github_actions_secret" "cdktf-provider-mongodbatlas_repo_secret-maven-staging-profile-id_7A0DF91E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-maven-username_553FE0BE will be created
  + resource "github_actions_secret" "cdktf-provider-mongodbatlas_repo_secret-maven-username_553FE0BE" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-npm-token_1689F3C4 will be created
  + resource "github_actions_secret" "cdktf-provider-mongodbatlas_repo_secret-npm-token_1689F3C4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-nuget-api-key_404500D3 will be created
  + resource "github_actions_secret" "cdktf-provider-mongodbatlas_repo_secret-nuget-api-key_404500D3" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-twine-password_C2DE8DEF will be created
  + resource "github_actions_secret" "cdktf-provider-mongodbatlas_repo_secret-twine-password_C2DE8DEF" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-twine-username_CFC0E61E will be created
  + resource "github_actions_secret" "cdktf-provider-mongodbatlas_repo_secret-twine-username_CFC0E61E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-mongodbatlas"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-oci_repo_secret-alert-prs-slack-webhook-url_5660A285 will be created
  + resource "github_actions_secret" "cdktf-provider-oci_repo_secret-alert-prs-slack-webhook-url_5660A285" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-oci"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-oci_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_86020CBE will be created
  + resource "github_actions_secret" "cdktf-provider-oci_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_86020CBE" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-oci"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-oci_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_4F1CAEC3 will be created
  + resource "github_actions_secret" "cdktf-provider-oci_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_4F1CAEC3" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-oci"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-oci_repo_secret-gh-token_ECA46A81 will be created
  + resource "github_actions_secret" "cdktf-provider-oci_repo_secret-gh-token_ECA46A81" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-oci"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-oci_repo_secret-maven-gpg-private-key-passphrase_1954F2E6 will be created
  + resource "github_actions_secret" "cdktf-provider-oci_repo_secret-maven-gpg-private-key-passphrase_1954F2E6" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-oci"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-oci_repo_secret-maven-gpg-private-key_6271BE99 will be created
  + resource "github_actions_secret" "cdktf-provider-oci_repo_secret-maven-gpg-private-key_6271BE99" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-oci"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-oci_repo_secret-maven-password_B4F122AD will be created
  + resource "github_actions_secret" "cdktf-provider-oci_repo_secret-maven-password_B4F122AD" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-oci"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-oci_repo_secret-maven-staging-profile-id_09F07CE2 will be created
  + resource "github_actions_secret" "cdktf-provider-oci_repo_secret-maven-staging-profile-id_09F07CE2" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-oci"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-oci_repo_secret-maven-username_ECA03C71 will be created
  + resource "github_actions_secret" "cdktf-provider-oci_repo_secret-maven-username_ECA03C71" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-oci"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-oci_repo_secret-npm-token_AECD4DD5 will be created
  + resource "github_actions_secret" "cdktf-provider-oci_repo_secret-npm-token_AECD4DD5" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-oci"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-oci_repo_secret-nuget-api-key_BA74DA13 will be created
  + resource "github_actions_secret" "cdktf-provider-oci_repo_secret-nuget-api-key_BA74DA13" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-oci"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-oci_repo_secret-twine-password_16670C99 will be created
  + resource "github_actions_secret" "cdktf-provider-oci_repo_secret-twine-password_16670C99" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-oci"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-oci_repo_secret-twine-username_A6430A9B will be created
  + resource "github_actions_secret" "cdktf-provider-oci_repo_secret-twine-username_A6430A9B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-oci"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretalertprsslackwebhookurl_99526CD8 will be destroyed
  # (because github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretalertprsslackwebhookurl_99526CD8 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfproviderlaunchdarkly_repo_secretalertprsslackwebhookurl_99526CD8" {
      - created_at      = "2023-07-26 08:56:43 +0000 UTC" -> null
      - id              = "cdktf-provider-launchdarkly:ALERT_PRS_SLACK_WEBHOOK_URL" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-launchdarkly" -> null
      - secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL" -> null
      - updated_at      = "2023-07-26 08:56:43 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretghtoken_B076E5A5 will be destroyed
  # (because github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretghtoken_B076E5A5 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfproviderlaunchdarkly_repo_secretghtoken_B076E5A5" {
      - created_at      = "2023-07-26 08:56:46 +0000 UTC" -> null
      - id              = "cdktf-provider-launchdarkly:GH_TOKEN" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-launchdarkly" -> null
      - secret_name     = "GH_TOKEN" -> null
      - updated_at      = "2023-07-26 08:56:46 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretghtokenaliasGOGITHUBTOKEN_E643F160 will be destroyed
  # (because github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretghtokenaliasGOGITHUBTOKEN_E643F160 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfproviderlaunchdarkly_repo_secretghtokenaliasGOGITHUBTOKEN_E643F160" {
      - created_at      = "2023-07-26 08:56:52 +0000 UTC" -> null
      - id              = "cdktf-provider-launchdarkly:GO_GITHUB_TOKEN" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-launchdarkly" -> null
      - secret_name     = "GO_GITHUB_TOKEN" -> null
      - updated_at      = "2023-07-26 08:56:52 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretghtokenaliasPROJENGITHUBTOKEN_D014A00B will be destroyed
  # (because github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretghtokenaliasPROJENGITHUBTOKEN_D014A00B is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfproviderlaunchdarkly_repo_secretghtokenaliasPROJENGITHUBTOKEN_D014A00B" {
      - created_at      = "2023-07-26 08:56:42 +0000 UTC" -> null
      - id              = "cdktf-provider-launchdarkly:PROJEN_GITHUB_TOKEN" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-launchdarkly" -> null
      - secret_name     = "PROJEN_GITHUB_TOKEN" -> null
      - updated_at      = "2023-07-26 08:56:42 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavengpgprivatekey_43CD5933 will be destroyed
  # (because github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavengpgprivatekey_43CD5933 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfproviderlaunchdarkly_repo_secretmavengpgprivatekey_43CD5933" {
      - created_at      = "2023-07-26 08:57:02 +0000 UTC" -> null
      - id              = "cdktf-provider-launchdarkly:MAVEN_GPG_PRIVATE_KEY" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-launchdarkly" -> null
      - secret_name     = "MAVEN_GPG_PRIVATE_KEY" -> null
      - updated_at      = "2023-07-26 08:57:02 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavengpgprivatekeypassphrase_416CB401 will be destroyed
  # (because github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavengpgprivatekeypassphrase_416CB401 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfproviderlaunchdarkly_repo_secretmavengpgprivatekeypassphrase_416CB401" {
      - created_at      = "2023-07-26 08:56:49 +0000 UTC" -> null
      - id              = "cdktf-provider-launchdarkly:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-launchdarkly" -> null
      - secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE" -> null
      - updated_at      = "2023-07-26 08:56:49 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavenpassword_B811F8CB will be destroyed
  # (because github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavenpassword_B811F8CB is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfproviderlaunchdarkly_repo_secretmavenpassword_B811F8CB" {
      - created_at      = "2023-07-26 08:56:51 +0000 UTC" -> null
      - id              = "cdktf-provider-launchdarkly:MAVEN_PASSWORD" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-launchdarkly" -> null
      - secret_name     = "MAVEN_PASSWORD" -> null
      - updated_at      = "2023-07-26 08:56:51 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavenstagingprofileid_919B2A41 will be destroyed
  # (because github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavenstagingprofileid_919B2A41 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfproviderlaunchdarkly_repo_secretmavenstagingprofileid_919B2A41" {
      - created_at      = "2023-07-26 08:56:48 +0000 UTC" -> null
      - id              = "cdktf-provider-launchdarkly:MAVEN_STAGING_PROFILE_ID" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-launchdarkly" -> null
      - secret_name     = "MAVEN_STAGING_PROFILE_ID" -> null
      - updated_at      = "2023-07-26 08:56:48 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavenusername_6CBB637A will be destroyed
  # (because github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretmavenusername_6CBB637A is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfproviderlaunchdarkly_repo_secretmavenusername_6CBB637A" {
      - created_at      = "2023-07-26 08:57:03 +0000 UTC" -> null
      - id              = "cdktf-provider-launchdarkly:MAVEN_USERNAME" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-launchdarkly" -> null
      - secret_name     = "MAVEN_USERNAME" -> null
      - updated_at      = "2023-07-26 08:57:03 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretnpmtoken_55C9B1E4 will be destroyed
  # (because github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretnpmtoken_55C9B1E4 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfproviderlaunchdarkly_repo_secretnpmtoken_55C9B1E4" {
      - created_at      = "2023-07-26 08:57:05 +0000 UTC" -> null
      - id              = "cdktf-provider-launchdarkly:NPM_TOKEN" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-launchdarkly" -> null
      - secret_name     = "NPM_TOKEN" -> null
      - updated_at      = "2023-07-26 08:57:05 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretnugetapikey_A8CFC2DD will be destroyed
  # (because github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secretnugetapikey_A8CFC2DD is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfproviderlaunchdarkly_repo_secretnugetapikey_A8CFC2DD" {
      - created_at      = "2023-10-17 12:55:15 +0000 UTC" -> null
      - id              = "cdktf-provider-launchdarkly:NUGET_API_KEY" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-launchdarkly" -> null
      - secret_name     = "NUGET_API_KEY" -> null
      - updated_at      = "2023-10-17 12:55:15 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secrettwinepassword_F4217409 will be destroyed
  # (because github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secrettwinepassword_F4217409 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfproviderlaunchdarkly_repo_secrettwinepassword_F4217409" {
      - created_at      = "2023-07-26 08:56:53 +0000 UTC" -> null
      - id              = "cdktf-provider-launchdarkly:TWINE_PASSWORD" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-launchdarkly" -> null
      - secret_name     = "TWINE_PASSWORD" -> null
      - updated_at      = "2023-07-26 08:56:53 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secrettwineusername_EC15FA2E will be destroyed
  # (because github_actions_secret.repospartners_cdktfproviderlaunchdarkly_repo_secrettwineusername_EC15FA2E is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfproviderlaunchdarkly_repo_secrettwineusername_EC15FA2E" {
      - created_at      = "2023-07-26 08:56:45 +0000 UTC" -> null
      - id              = "cdktf-provider-launchdarkly:TWINE_USERNAME" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-launchdarkly" -> null
      - secret_name     = "TWINE_USERNAME" -> null
      - updated_at      = "2023-07-26 08:56:45 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretalertprsslackwebhookurl_27DBACFE will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretalertprsslackwebhookurl_27DBACFE is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretalertprsslackwebhookurl_27DBACFE" {
      - created_at      = "2023-01-27 16:12:18 +0000 UTC" -> null
      - id              = "cdktf-provider-mongodbatlas:ALERT_PRS_SLACK_WEBHOOK_URL" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-mongodbatlas" -> null
      - secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL" -> null
      - updated_at      = "2023-01-27 16:12:18 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtoken_E25B0748 will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtoken_E25B0748 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretghtoken_E25B0748" {
      - created_at      = "2023-01-27 16:12:28 +0000 UTC" -> null
      - id              = "cdktf-provider-mongodbatlas:GH_TOKEN" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-mongodbatlas" -> null
      - secret_name     = "GH_TOKEN" -> null
      - updated_at      = "2023-01-27 16:12:28 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasGOGITHUBTOKEN_7F93E828 will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasGOGITHUBTOKEN_7F93E828 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasGOGITHUBTOKEN_7F93E828" {
      - created_at      = "2023-01-27 16:12:06 +0000 UTC" -> null
      - id              = "cdktf-provider-mongodbatlas:GO_GITHUB_TOKEN" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-mongodbatlas" -> null
      - secret_name     = "GO_GITHUB_TOKEN" -> null
      - updated_at      = "2023-01-27 16:12:06 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasPROJENGITHUBTOKEN_C1B036A4 will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasPROJENGITHUBTOKEN_C1B036A4 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretghtokenaliasPROJENGITHUBTOKEN_C1B036A4" {
      - created_at      = "2023-01-27 16:12:27 +0000 UTC" -> null
      - id              = "cdktf-provider-mongodbatlas:PROJEN_GITHUB_TOKEN" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-mongodbatlas" -> null
      - secret_name     = "PROJEN_GITHUB_TOKEN" -> null
      - updated_at      = "2023-01-27 16:12:27 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekey_95F35FFB will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekey_95F35FFB is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekey_95F35FFB" {
      - created_at      = "2023-01-27 16:12:10 +0000 UTC" -> null
      - id              = "cdktf-provider-mongodbatlas:MAVEN_GPG_PRIVATE_KEY" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-mongodbatlas" -> null
      - secret_name     = "MAVEN_GPG_PRIVATE_KEY" -> null
      - updated_at      = "2023-01-27 16:12:10 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekeypassphrase_1A7C8C8A will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekeypassphrase_1A7C8C8A is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretmavengpgprivatekeypassphrase_1A7C8C8A" {
      - created_at      = "2023-01-27 16:12:07 +0000 UTC" -> null
      - id              = "cdktf-provider-mongodbatlas:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-mongodbatlas" -> null
      - secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE" -> null
      - updated_at      = "2023-01-27 16:12:07 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenpassword_B7E76303 will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenpassword_B7E76303 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretmavenpassword_B7E76303" {
      - created_at      = "2023-01-27 16:12:05 +0000 UTC" -> null
      - id              = "cdktf-provider-mongodbatlas:MAVEN_PASSWORD" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-mongodbatlas" -> null
      - secret_name     = "MAVEN_PASSWORD" -> null
      - updated_at      = "2023-01-27 16:12:05 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenstagingprofileid_ACEFEFB8 will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenstagingprofileid_ACEFEFB8 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretmavenstagingprofileid_ACEFEFB8" {
      - created_at      = "2023-01-27 16:12:22 +0000 UTC" -> null
      - id              = "cdktf-provider-mongodbatlas:MAVEN_STAGING_PROFILE_ID" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-mongodbatlas" -> null
      - secret_name     = "MAVEN_STAGING_PROFILE_ID" -> null
      - updated_at      = "2023-01-27 16:12:22 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenusername_FEB58691 will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretmavenusername_FEB58691 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretmavenusername_FEB58691" {
      - created_at      = "2023-01-27 16:12:23 +0000 UTC" -> null
      - id              = "cdktf-provider-mongodbatlas:MAVEN_USERNAME" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-mongodbatlas" -> null
      - secret_name     = "MAVEN_USERNAME" -> null
      - updated_at      = "2023-01-27 16:12:23 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnpmtoken_065C759D will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnpmtoken_065C759D is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretnpmtoken_065C759D" {
      - created_at      = "2023-01-27 16:12:16 +0000 UTC" -> null
      - id              = "cdktf-provider-mongodbatlas:NPM_TOKEN" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-mongodbatlas" -> null
      - secret_name     = "NPM_TOKEN" -> null
      - updated_at      = "2023-01-27 16:12:16 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnugetapikey_F529A53B will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secretnugetapikey_F529A53B is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secretnugetapikey_F529A53B" {
      - created_at      = "2023-10-17 12:55:16 +0000 UTC" -> null
      - id              = "cdktf-provider-mongodbatlas:NUGET_API_KEY" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-mongodbatlas" -> null
      - secret_name     = "NUGET_API_KEY" -> null
      - updated_at      = "2023-10-17 12:55:16 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwinepassword_0017705E will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwinepassword_0017705E is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secrettwinepassword_0017705E" {
      - created_at      = "2023-01-27 16:12:19 +0000 UTC" -> null
      - id              = "cdktf-provider-mongodbatlas:TWINE_PASSWORD" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-mongodbatlas" -> null
      - secret_name     = "TWINE_PASSWORD" -> null
      - updated_at      = "2023-01-27 16:12:19 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwineusername_BB8420B9 will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovidermongodbatlas_repo_secrettwineusername_BB8420B9 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovidermongodbatlas_repo_secrettwineusername_BB8420B9" {
      - created_at      = "2023-01-27 16:12:26 +0000 UTC" -> null
      - id              = "cdktf-provider-mongodbatlas:TWINE_USERNAME" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-mongodbatlas" -> null
      - secret_name     = "TWINE_USERNAME" -> null
      - updated_at      = "2023-01-27 16:12:26 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretalertprsslackwebhookurl_3790356E will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovideroci_repo_secretalertprsslackwebhookurl_3790356E is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretalertprsslackwebhookurl_3790356E" {
      - created_at      = "2023-10-09 10:04:36 +0000 UTC" -> null
      - id              = "cdktf-provider-oci:ALERT_PRS_SLACK_WEBHOOK_URL" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-oci" -> null
      - secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL" -> null
      - updated_at      = "2023-10-09 10:04:36 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretghtoken_6F139405 will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovideroci_repo_secretghtoken_6F139405 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretghtoken_6F139405" {
      - created_at      = "2023-10-09 10:04:25 +0000 UTC" -> null
      - id              = "cdktf-provider-oci:GH_TOKEN" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-oci" -> null
      - secret_name     = "GH_TOKEN" -> null
      - updated_at      = "2023-10-09 10:04:25 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretghtokenaliasGOGITHUBTOKEN_25D1F7A6 will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovideroci_repo_secretghtokenaliasGOGITHUBTOKEN_25D1F7A6 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretghtokenaliasGOGITHUBTOKEN_25D1F7A6" {
      - created_at      = "2023-10-09 10:04:27 +0000 UTC" -> null
      - id              = "cdktf-provider-oci:GO_GITHUB_TOKEN" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-oci" -> null
      - secret_name     = "GO_GITHUB_TOKEN" -> null
      - updated_at      = "2023-10-09 10:04:27 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretghtokenaliasPROJENGITHUBTOKEN_AFFD0880 will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovideroci_repo_secretghtokenaliasPROJENGITHUBTOKEN_AFFD0880 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretghtokenaliasPROJENGITHUBTOKEN_AFFD0880" {
      - created_at      = "2023-10-09 10:04:30 +0000 UTC" -> null
      - id              = "cdktf-provider-oci:PROJEN_GITHUB_TOKEN" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-oci" -> null
      - secret_name     = "PROJEN_GITHUB_TOKEN" -> null
      - updated_at      = "2023-10-09 10:04:30 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretmavengpgprivatekey_987D9503 will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovideroci_repo_secretmavengpgprivatekey_987D9503 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretmavengpgprivatekey_987D9503" {
      - created_at      = "2023-10-09 10:04:45 +0000 UTC" -> null
      - id              = "cdktf-provider-oci:MAVEN_GPG_PRIVATE_KEY" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-oci" -> null
      - secret_name     = "MAVEN_GPG_PRIVATE_KEY" -> null
      - updated_at      = "2023-10-09 10:04:45 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretmavengpgprivatekeypassphrase_23BF0189 will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovideroci_repo_secretmavengpgprivatekeypassphrase_23BF0189 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretmavengpgprivatekeypassphrase_23BF0189" {
      - created_at      = "2023-10-09 10:04:24 +0000 UTC" -> null
      - id              = "cdktf-provider-oci:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-oci" -> null
      - secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE" -> null
      - updated_at      = "2023-10-09 10:04:24 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretmavenpassword_F4891CBD will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovideroci_repo_secretmavenpassword_F4891CBD is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretmavenpassword_F4891CBD" {
      - created_at      = "2023-10-09 10:04:43 +0000 UTC" -> null
      - id              = "cdktf-provider-oci:MAVEN_PASSWORD" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-oci" -> null
      - secret_name     = "MAVEN_PASSWORD" -> null
      - updated_at      = "2023-10-09 10:04:43 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretmavenstagingprofileid_6643BA7C will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovideroci_repo_secretmavenstagingprofileid_6643BA7C is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretmavenstagingprofileid_6643BA7C" {
      - created_at      = "2023-10-09 10:04:29 +0000 UTC" -> null
      - id              = "cdktf-provider-oci:MAVEN_STAGING_PROFILE_ID" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-oci" -> null
      - secret_name     = "MAVEN_STAGING_PROFILE_ID" -> null
      - updated_at      = "2023-10-09 10:04:29 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretmavenusername_4524298E will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovideroci_repo_secretmavenusername_4524298E is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretmavenusername_4524298E" {
      - created_at      = "2023-10-09 10:04:22 +0000 UTC" -> null
      - id              = "cdktf-provider-oci:MAVEN_USERNAME" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-oci" -> null
      - secret_name     = "MAVEN_USERNAME" -> null
      - updated_at      = "2023-10-09 10:04:22 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretnpmtoken_22C77021 will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovideroci_repo_secretnpmtoken_22C77021 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretnpmtoken_22C77021" {
      - created_at      = "2023-10-09 10:04:31 +0000 UTC" -> null
      - id              = "cdktf-provider-oci:NPM_TOKEN" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-oci" -> null
      - secret_name     = "NPM_TOKEN" -> null
      - updated_at      = "2023-10-09 10:04:31 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovideroci_repo_secretnugetapikey_A99E59FC will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovideroci_repo_secretnugetapikey_A99E59FC is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secretnugetapikey_A99E59FC" {
      - created_at      = "2023-10-17 12:55:14 +0000 UTC" -> null
      - id              = "cdktf-provider-oci:NUGET_API_KEY" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-oci" -> null
      - secret_name     = "NUGET_API_KEY" -> null
      - updated_at      = "2023-10-17 12:55:14 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovideroci_repo_secrettwinepassword_6524D0D4 will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovideroci_repo_secrettwinepassword_6524D0D4 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secrettwinepassword_6524D0D4" {
      - created_at      = "2023-10-09 10:04:44 +0000 UTC" -> null
      - id              = "cdktf-provider-oci:TWINE_PASSWORD" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-oci" -> null
      - secret_name     = "TWINE_PASSWORD" -> null
      - updated_at      = "2023-10-09 10:04:44 +0000 UTC" -> null
    }

  # github_actions_secret.repospartners_cdktfprovideroci_repo_secrettwineusername_5163EE80 will be destroyed
  # (because github_actions_secret.repospartners_cdktfprovideroci_repo_secrettwineusername_5163EE80 is not in configuration)
  - resource "github_actions_secret" "repospartners_cdktfprovideroci_repo_secrettwineusername_5163EE80" {
      - created_at      = "2023-10-09 10:04:42 +0000 UTC" -> null
      - id              = "cdktf-provider-oci:TWINE_USERNAME" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "cdktf-provider-oci" -> null
      - secret_name     = "TWINE_USERNAME" -> null
      - updated_at      = "2023-10-09 10:04:42 +0000 UTC" -> null
    }

  # github_branch_protection.cdktf-provider-launchdarkly_repository-setup_main-protection_5F1810F7 will be created
  + resource "github_branch_protection" "cdktf-provider-launchdarkly_repository-setup_main-protection_5F1810F7" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "cdktf-provider-launchdarkly"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_status_checks {
          + contexts = [
              + "Validate PR title",
              + "build",
              + "package-dotnet",
              + "package-go",
              + "package-java",
              + "package-js",
              + "package-python",
            ]
          + strict   = true
        }
    }

  # github_branch_protection.cdktf-provider-mongodbatlas_repository-setup_main-protection_C19EA731 will be created
  + resource "github_branch_protection" "cdktf-provider-mongodbatlas_repository-setup_main-protection_C19EA731" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "cdktf-provider-mongodbatlas"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_status_checks {
          + contexts = [
              + "Validate PR title",
              + "build",
              + "package-dotnet",
              + "package-go",
              + "package-java",
              + "package-js",
              + "package-python",
            ]
          + strict   = true
        }
    }

  # github_branch_protection.cdktf-provider-oci_repository-setup_main-protection_A504853A will be created
  + resource "github_branch_protection" "cdktf-provider-oci_repository-setup_main-protection_A504853A" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "cdktf-provider-oci"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_status_checks {
          + contexts = [
              + "Validate PR title",
              + "build",
              + "package-dotnet",
              + "package-go",
              + "package-java",
              + "package-js",
              + "package-python",
            ]
          + strict   = true
        }
    }

  # github_branch_protection.repospartners_cdktfproviderlaunchdarkly_repositorysetup_mainprotection_275B3DCB will be destroyed
  # (because github_branch_protection.repospartners_cdktfproviderlaunchdarkly_repositorysetup_mainprotection_275B3DCB is not in configuration)
  - resource "github_branch_protection" "repospartners_cdktfproviderlaunchdarkly_repositorysetup_mainprotection_275B3DCB" {
      - allows_deletions                = false -> null
      - allows_force_pushes             = false -> null
      - blocks_creations                = false -> null
      - enforce_admins                  = true -> null
      - force_push_bypassers            = [] -> null
      - id                              = "BPR_kwDOJ_5BQc4CYBOl" -> null
      - lock_branch                     = false -> null
      - pattern                         = "main" -> null
      - push_restrictions               = [] -> null
      - repository_id                   = "cdktf-provider-launchdarkly" -> null
      - require_conversation_resolution = false -> null
      - require_signed_commits          = false -> null
      - required_linear_history         = false -> null

      - required_status_checks {
          - contexts = [
              - "Validate PR title",
              - "build",
              - "package-dotnet",
              - "package-go",
              - "package-java",
              - "package-js",
              - "package-python",
            ] -> null
          - strict   = true -> null
        }
    }

  # github_branch_protection.repospartners_cdktfprovidermongodbatlas_repositorysetup_mainprotection_D2492D82 will be destroyed
  # (because github_branch_protection.repospartners_cdktfprovidermongodbatlas_repositorysetup_mainprotection_D2492D82 is not in configuration)
  - resource "github_branch_protection" "repospartners_cdktfprovidermongodbatlas_repositorysetup_mainprotection_D2492D82" {
      - allows_deletions                = false -> null
      - allows_force_pushes             = false -> null
      - blocks_creations                = false -> null
      - enforce_admins                  = true -> null
      - force_push_bypassers            = [] -> null
      - id                              = "BPR_kwDOI2liXc4CAYbG" -> null
      - lock_branch                     = false -> null
      - pattern                         = "main" -> null
      - push_restrictions               = [] -> null
      - repository_id                   = "cdktf-provider-mongodbatlas" -> null
      - require_conversation_resolution = false -> null
      - require_signed_commits          = false -> null
      - required_linear_history         = false -> null

      - required_status_checks {
          - contexts = [
              - "Validate PR title",
              - "build",
              - "package-dotnet",
              - "package-go",
              - "package-java",
              - "package-js",
              - "package-python",
            ] -> null
          - strict   = true -> null
        }
    }

  # github_branch_protection.repospartners_cdktfprovideroci_repositorysetup_mainprotection_C9A55A1D will be destroyed
  # (because github_branch_protection.repospartners_cdktfprovideroci_repositorysetup_mainprotection_C9A55A1D is not in configuration)
  - resource "github_branch_protection" "repospartners_cdktfprovideroci_repositorysetup_mainprotection_C9A55A1D" {
      - allows_deletions                = false -> null
      - allows_force_pushes             = false -> null
      - blocks_creations                = false -> null
      - enforce_admins                  = true -> null
      - force_push_bypassers            = [] -> null
      - id                              = "BPR_kwDOKd5LNs4CiG6p" -> null
      - lock_branch                     = false -> null
      - pattern                         = "main" -> null
      - push_restrictions               = [] -> null
      - repository_id                   = "cdktf-provider-oci" -> null
      - require_conversation_resolution = false -> null
      - require_signed_commits          = false -> null
      - required_linear_history         = false -> null

      - required_status_checks {
          - contexts = [
              - "Validate PR title",
              - "build",
              - "package-dotnet",
              - "package-go",
              - "package-java",
              - "package-js",
              - "package-python",
            ] -> null
          - strict   = true -> null
        }
    }

  # github_issue_label.cdktf-provider-launchdarkly-go_repository-setup_automerge-label_0BF643DC will be created
  + resource "github_issue_label" "cdktf-provider-launchdarkly-go_repository-setup_automerge-label_0BF643DC" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-launchdarkly-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-launchdarkly_repository-setup_automerge-label_3D9A8B34 will be created
  + resource "github_issue_label" "cdktf-provider-launchdarkly_repository-setup_automerge-label_3D9A8B34" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-launchdarkly"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-mongodbatlas-go_repository-setup_automerge-label_6A04EB24 will be created
  + resource "github_issue_label" "cdktf-provider-mongodbatlas-go_repository-setup_automerge-label_6A04EB24" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-mongodbatlas-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-mongodbatlas_repository-setup_automerge-label_ADD15693 will be created
  + resource "github_issue_label" "cdktf-provider-mongodbatlas_repository-setup_automerge-label_ADD15693" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-mongodbatlas"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-oci-go_repository-setup_automerge-label_650B48E9 will be created
  + resource "github_issue_label" "cdktf-provider-oci-go_repository-setup_automerge-label_650B48E9" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-oci-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-oci_repository-setup_automerge-label_8DEB6AA7 will be created
  + resource "github_issue_label" "cdktf-provider-oci_repository-setup_automerge-label_8DEB6AA7" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktf-provider-oci"
      + url        = (known after apply)
    }

  # github_issue_label.repospartners_cdktfproviderlaunchdarkly_repositorysetup_automergelabel_0E78197D will be destroyed
  # (because github_issue_label.repospartners_cdktfproviderlaunchdarkly_repositorysetup_automergelabel_0E78197D is not in configuration)
  - resource "github_issue_label" "repospartners_cdktfproviderlaunchdarkly_repositorysetup_automergelabel_0E78197D" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"eaad87ea34234699abef39ffc0fcca649282e06118179df79831e370f5a7511d\"" -> null
      - id         = "cdktf-provider-launchdarkly:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-launchdarkly" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-launchdarkly/labels/automerge" -> null
    }

  # github_issue_label.repospartners_cdktfproviderlaunchdarklygo_repositorysetup_automergelabel_35291F2B will be destroyed
  # (because github_issue_label.repospartners_cdktfproviderlaunchdarklygo_repositorysetup_automergelabel_35291F2B is not in configuration)
  - resource "github_issue_label" "repospartners_cdktfproviderlaunchdarklygo_repositorysetup_automergelabel_35291F2B" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"5b88ddfff32d12022b6ee4a29ef141a9ec73de976109c8f342a7518000f64368\"" -> null
      - id         = "cdktf-provider-launchdarkly-go:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-launchdarkly-go" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-launchdarkly-go/labels/automerge" -> null
    }

  # github_issue_label.repospartners_cdktfprovidermongodbatlas_repositorysetup_automergelabel_3E161F2F will be destroyed
  # (because github_issue_label.repospartners_cdktfprovidermongodbatlas_repositorysetup_automergelabel_3E161F2F is not in configuration)
  - resource "github_issue_label" "repospartners_cdktfprovidermongodbatlas_repositorysetup_automergelabel_3E161F2F" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"6ef562be951277413b30a8729dabfa778b4b253090b07ae236868cb9f8915c21\"" -> null
      - id         = "cdktf-provider-mongodbatlas:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-mongodbatlas" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-mongodbatlas/labels/automerge" -> null
    }

  # github_issue_label.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_automergelabel_B7FEA225 will be destroyed
  # (because github_issue_label.repospartners_cdktfprovidermongodbatlasgo_repositorysetup_automergelabel_B7FEA225 is not in configuration)
  - resource "github_issue_label" "repospartners_cdktfprovidermongodbatlasgo_repositorysetup_automergelabel_B7FEA225" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"0e3589c0de81a1d54afd90ef175787c7ea8199e797cd5d19920a5b1aadcdd47d\"" -> null
      - id         = "cdktf-provider-mongodbatlas-go:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-mongodbatlas-go" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-mongodbatlas-go/labels/automerge" -> null
    }

  # github_issue_label.repospartners_cdktfprovideroci_repositorysetup_automergelabel_F7457F62 will be destroyed
  # (because github_issue_label.repospartners_cdktfprovideroci_repositorysetup_automergelabel_F7457F62 is not in configuration)
  - resource "github_issue_label" "repospartners_cdktfprovideroci_repositorysetup_automergelabel_F7457F62" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"9c85e8acb415ddcbb57c7ede2780c70b0e0267be10d99a254596ba009c683cb5\"" -> null
      - id         = "cdktf-provider-oci:automerge" -> null
      - name       = "automerge" -> null
      - repository = "cdktf-provider-oci" -> null
      - url        = "https://api.github.com/repos/cdktf/cdktf-provider-oci/labels/automerge" -> null
    }

  # github_issue_label.repospartners_cdktfproviderocigo_repositorysetup_automergelabel_4D800EB9 will be destroyed
  # (because github_issue_label.repospartners_cdktfproviderocigo_repositorysetup_automergelabel_4D800EB9 is not in configuration)
  - resource "github_issue_label" "repospartners_cdktfproviderocigo_repositorysetup_automergelabel_4D800EB9" {
      - color      = "5DC8DB" -> null
      - etag       = "W/\"bb39e8dc793bc3d9113d55e5f3d83a0ae53b6f2aea4a4e290fddf1fca511b0d7\"" -> null
      - ...
```

</details>

*Pusher: @DanielMSchmidt, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*